---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstanceFilter.FamilySymbolId
source: html/ca671e94-c095-4577-12e6-efa5918cc5f6.htm
---
# Autodesk.Revit.DB.FamilyInstanceFilter.FamilySymbolId Property

The family symbol id.

## Syntax (C#)
```csharp
public ElementId FamilySymbolId { get; }
```